20230615202409-llms_as_data_analyst.tex
% Created 2023-06-23 Fri 10:00
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\author{Reyva Babtista}
\date{\today}
\title{LLMs as data analyst}
\hypersetup{
 pdfauthor={Reyva Babtista},
 pdftitle={LLMs as data analyst},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.6.1)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Cheng, L., Li, X., \& Bing, L. (2023). Is GPT-4 a Good Data Analyst?}
\label{sec:org8c08a2d}
This papar talked about comparing GPT-4's
performance of data analysis to actual data analyst. Their GPT-4 as data
analyst's experiment framework are:
\begin{enumerate}
\item code generation (for data collection and data visualization),
\item code execution, and
\item analysis generation (for data analysis).
\end{enumerate}
They used nvBench dataset to evaluate their experiments. Their evaluation
metrics include figure evaluation (information correctness, chart type
correctness, aesthetics) and analysis evaluation (correctness, alignment,
complexity, fluency).

Although they found that GPT-4 perfomances are comparable to human data
analysts, GPT-4 still suffer from hallucination or poor calculation accuracy.
Furthermore, there is still a need of human intervention to:
\begin{enumerate}
\item Ask the right questions to be answered by ChatGPT.
\item Prepare the data and execute the code in between the experiment.
\end{enumerate}

\section{Hassan, M. M., Knipper, A., \& Santu, S. K. K. (2023). ChatGPT as your Personal Data Scientist.}
\label{sec:org744fe14}
The paper proposed a new architecture utilizing ChatGPT for user-friendly
automated machine learning (AutoML). Although it is an interesting idea, it is
not also clear in the paper how their proposed system is user friendly and
automated. More time needed to understand the paper since it is long and
complex.

\section{Noever, D., \& McKee, F. (2023). Numeracy from Literacy: Data Science as an Emergent Skill from Large Language Models.}
\label{sec:org5032006}
The paper explore the possibility of ChatGPT as a tool for exploratory data
analysis. The experiments executed CRUD operations to well known datasets such
as Iris, Titanic survival, and Boston housing prices. The random sampling and
CRUD operations to the dataset made sure that ChatGPT will not rely on training
data but only their own numerical calculations.

Their finding were that the latest LLMs have reached sufficient scale to handle
complex statistical questions.

Questions emerge from reading this paper:
\begin{enumerate}
\item How can we provide datasets as the ``input data'' to provide additional context
for ChatGPT?
\item Can ChatGPT's memory capacity be increased? Would that help ChatGPT to
generate better answers? \url{https://redis.com/blog/chatgpt-memory-project/}
\end{enumerate}

\section{Hassani, H., \& Silva, E. S. (2023). The Role of ChatGPT in Data Science: How AI-Assisted Conversational Interfaces Are Revolutionizing the Field. Big Data and Cognitive Computing, 7(2), 62. \url{http://dx.doi.org/10.3390/bdcc7020062}}
\label{sec:org17eee30}
Reading in progress.

\section{Chatterjee, J., \& Dethlefs, N. (2023). This new conversational AI model can be your friend, philosopher, and guide .. and even your worst enemy. Patterns, 4(1), 100676. \url{http://dx.doi.org/10.1016/j.patter.2022.100676}}
\label{sec:orgbb9c93b}
This short paper reviews the potential and danger of ChatGPT and show some
examples of them. Not necessarily relevant to the topic of utilizing ChatGPT for
data science. However, this paper can be cited for our paper's introduction.
\end{document}